app/views/others/assign.html.erb

	<td><%= user.email %></td>
        <td><% Role.where(:id => user.role_id).each do |role| %>
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? ORDER BY "roles"."id" ASC LIMIT 1  [["id", 1]]