app/views/pages/search.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1
---
      <tr>
        <td><% Account.where(:id => transaction.from_account_id).each do |account| %>