app/views/admin/roles/_sidebar.html.haml


      - (@roles || Role.all).each do |role|
---
SELECT "roles".* FROM "roles" ORDER BY created_at ASC

          = link_to role.title, edit_admin_role_url(role)
          (#{role.users.count})
---
SELECT COUNT(*) FROM "users" WHERE "users"."role_id" = ?  [["role_id", 1]]