app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" ORDER BY "accounts"."id" ASC LIMIT 1
---
  def index
    @accounts = Account.all

INSERT INTO "accounts" ("a_amount", "a_name", "a_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["a_amount", 5000.0], ["a_name", "Bank"], ["a_type", "Liability"], ["created_at", Sat, 07 Dec 2013 18:45:09 UTC +00:00], ["updated_at", Sat, 07 Dec 2013 18:45:09 UTC +00:00]]
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save

UPDATE "accounts" SET "a_name" = ?, "a_amount" = ?, "updated_at" = ? WHERE "accounts"."id" = 1  [["a_name", "Bank"], ["a_amount", 45000.0], ["updated_at", Sun, 22 Dec 2013 23:53:52 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)