app/controllers/others_controller.rb

 def assign
   @roles = Role.all
   @users = User.all
   @assigned_user = params[:user]
   @assigned_role = params[:role]
   if @assigned_user != "" and @assigned_role != "" and @assigned_user and @assigned_role
       user = User.find_by_id(@assigned_user)
       user.update( role: Role.find_by_id(@assigned_role))
---
SELECT "roles".* FROM "roles"
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? ORDER BY "roles"."id" ASC LIMIT 1  [["id", 1]]