app/controllers/pages_controller.rb

SELECT "accounts".* FROM "accounts"
SELECT "transactions".* FROM "transactions" WHERE ('t_amount') AND ('from_account_id') AND ('to_account_id')
---
  def search
    @accounts = Account.all
    @amount = params[:amount]
    @f_account = params[:f_account]
    @t_account = params[:t_account]
    @t_date = params[:t_date]
    @transactions = Transaction.search(@amount,@f_account, @t_account, @t_date)