app/controllers/transactions_controller.rb

SELECT t_date AS transaction_date, sum(t_amount) as amount_sum FROM "transactions" GROUP BY t_date
---
  def index
    @transactions = Transaction.all

INSERT INTO "transactions" ("created_at", "t_amount", "t_date", "t_desc", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 07 Dec 2013 18:29:38 UTC +00:00], ["t_amount", 5000.0], ["t_date", Sat, 07 Dec 2013], ["t_desc", "kjkj"], ["updated_at", Sat, 07 Dec 2013 18:29:38 UTC +00:00]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" IS NULL LIMIT 1
UPDATE "accounts" SET "a_amount" = ?, "updated_at" = ? WHERE "accounts"."id" = 1  [["a_amount", 0.0], ["updated_at", Fri, 13 Dec 2013 18:00:09 UTC +00:00]]
---
  def create
    @transaction = Transaction.new(transaction_params)


      respond_to do |format|
      if @transaction.save
        format.html { redirect_to @transaction, notice: 'Transaction was successfully created.' }
        format.json { render action: 'show', status: :created, location: @transaction }
     else
	format.html { render action: 'new' }
        format.json { render json: @transaction.errors, status: :unprocessable_entity }
     end
     end

   if transaction_params[:t_amount].to_f > 0
	   account_from = Account.find_by_id(transaction_params[:from_account_id])
   	   account_from.a_amount = account_from.a_amount - transaction_params[:t_amount].to_f
	   if account_from.a_amount >= 0
        	account_from.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
UPDATE "accounts" SET "a_amount" = ?, "updated_at" = ? WHERE "accounts"."id" = 1  [["a_amount", 0.0], ["updated_at", Fri, 13 Dec 2013 21:06:03 UTC +00:00]]
UPDATE "transactions" SET "from_account_id" = ?, "to_account_id" = ?, "updated_at" = ? WHERE "transactions"."id" = 1  [["from_account_id", 4], ["to_account_id", 1], ["updated_at", Fri, 13 Dec 2013 21:06:51 UTC +00:00]]
---
  def update


 if transaction_params[:t_amount].to_f > 0
	   current_transaction = Transaction.find_by_id(transaction_params[:id])
	   account_from = Account.find_by_id(transaction_params[:from_account_id])
   	   account_from.a_amount = account_from.a_amount + @transaction.t_amount - transaction_params[:t_amount].to_f
	   if account_from.a_amount >= 0
        	account_from.save

DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 3]]
---
  def destroy
    @transaction.destroy