app/views/transactions/_form.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "accounts".* FROM "accounts"
---
    <% if @transaction.from_account_id != nil %>
      <%= f.collection_select :from_account_id, Account.where("id = " + @transaction.from_account_id.to_s), :id, :a_name, :class => 'dropdown-toggle' %>
    <% else %>
      <%= f.collection_select :from_account_id, Account.all, :id, :a_name, :prompt => "Select a prospect", :class => 'dropdown-toggle'%>