app/views/transactions/index.html.erb

      <tr>
        <td><% Account.where(:id => transaction.from_account_id).each do |account| %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 'from_account' LIMIT 1

        data.addColumn('number', 'Amount');
	<% @amount_by_day = Transaction.group(:t_date).select("t_date AS transaction_date", "sum(t_amount) as amount_sum") %>
---
SELECT t_date AS transaction_date, sum(t_amount) as amount_sum FROM "transactions" GROUP BY t_date