app/views/transactions/show.html.erb

  <%#= @transaction.from_account_id %>
  <% Account.where(:id => @transaction.from_account_id).each do |account| %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 'from_account' LIMIT 1